URLShortener/app/models/shortened_url.rb

    def self.random_code
        random_url = SecureRandom.urlsafe_base64
        while ShortenedUrl.exists?(short_url:random_url)
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "7JzSYU7Fd_iIXY4nJ9D-oQ"], ["LIMIT", 1]]

    def self.generate(user, url)
        ShortenedUrl.create!(user_id:user.id, long_url:url, short_url:ShortenedUrl.random_code)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "google.com"], ["short_url", "7JzSYU7Fd_iIXY4nJ9D-oQ"], ["created_at", "2021-05-20 21:27:39.401450"], ["updated_at", "2021-05-20 21:27:39.401450"], ["user_id", 4]]